eisup_2019_docmng_integration/src/Catalogs/абс_СоставФинансовыхПоказателей/абс_СоставФинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_СоставФинансовыхПоказателей</name>
  <attributes>
    <name>Формула</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСоставБюджетныхСтатей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДляВычисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыЗапроса</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьиБюджетов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБюджетныхСтатей</name>
    <attributes>
      <name>БюджетнаяСтатья</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_СоставФинансовыхПоказателей/ObjectModule.bsl
Функция ВыполнитьЗапрос(ТекстЗапроса=Неопределено,ПараметрыЗапросаВн=Неопределено)Экспорт
	
		
	ПостроительОтчетов = Новый ПостроительОтчета;
	
	БюджетныеСтатьи = СоставБюджетныхСтатей.Выгрузить(,"БюджетнаяСтатья");
	Попытка	
		ПостроительОтчетов.Текст = ?(ТекстЗапроса=Неопределено,ЗначениеПоказателя,ТекстЗапроса);
		
		
		МассивДляПоиска = Новый Массив;
		СТПараметрыЗапроса = Новый Массив;
		
		Для Каждого ТекЭлемент ИЗ ПараметрыЗапроса Цикл	
			ИндексЭлемента = МассивДляПоиска.Найти(ТекЭлемент.ИмяПараметра);
			Если ИндексЭлемента = Неопределено Тогда
				
				СтруктураПараметров  = Новый Структура("ИмяПараметра,Значение");	 
				СтруктураПараметров.ИмяПараметра = ТекЭлемент.ИмяПараметра;
				СтруктураПараметров.Значение = ?(ТекЭлемент.СтатьиБюджетов,БюджетныеСтатьи,ТекЭлемент.Значение);
				СТПараметрыЗапроса.Добавить(СтруктураПараметров);
				МассивДляПоиска.Добавить(ТекЭлемент.ИмяПараметра);
			Иначе
				Если ТипЗнч(СТПараметрыЗапроса[ИндексЭлемента].Значение) = Тип("Массив")Тогда
					СТПараметрыЗапроса[ИндексЭлемента].Значение.Добавить(ТекЭлемент.Значение);		 
				Иначе	 
					МассивЗначений = Новый Массив;
					МассивЗначений.Добавить(СТПараметрыЗапроса[ИндексЭлемента].Значение);
					МассивЗначений.Добавить(ТекЭлемент.Значение);
					СТПараметрыЗапроса[ИндексЭлемента].Значение = МассивЗначений;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		
		Если ПараметрыЗапросаВн <> Неопределено Тогда
		Для Каждого ЭлементМассива Из СТПараметрыЗапроса Цикл
				  Для Каждого ЭлементМассиваВн Из ПараметрыЗапросаВн Цикл  
				
					Если ЭлементМассива.ИмяПараметра =ЭлементМассиваВн.ИмяПараметра Тогда
						   ЭлементМассива.Значение =ЭлементМассиваВн.Значение;
					КонецЕсли;
					   
		         КонецЦикла;
			КонецЦикла;	
	
		КонецЕсли;	
	

		
		Для Каждого Параметр Из СТПараметрыЗапроса Цикл
					ПостроительОтчетов.Параметры.Вставить(Параметр.ИмяПараметра,Параметр.Значение);
		КонецЦикла;
		ПостроительОтчетов.Выполнить();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
		
    
	//ПостроительОтчетов.Вывести();
    Возврат ПостроительОтчетов;
	
КонецФункции

Функция ВычислитьПоФормуле(ПараметрыФормулы) Экспорт
	ФормулаДляРасчета = ЗначениеПоказателя;
	Для Каждого ТекСтрока Из ПараметрыФормулы Цикл
		
		ФормулаДляРасчета = СтрЗаменить(ФормулаДляРасчета,ТекСтрока.ИмяПараметра,
		                    Строка(Формат(Окр(ТекСтрока.Значение),"ЧН=0; ЧГ=0")));
		               
	КонецЦикла;

	СуммаВозврат = 0;
	//Попытка
	//	СуммаВозврат = Вычислить(ФормулаДляРасчета);
	//Исключение
	//	Сообщить(ОписаниеОшибки());

	//КонецПопытки;	
	
		СуммаВозврат = Вычислить(ФормулаДляРасчета);
		//Сообщить(ОписаниеОшибки());

	
	Возврат СуммаВозврат;
	
КонецФункции

Функция ВыполнитьСлияниеДвухМассивов(МассивОсновной,МассивДополнительный)
	//
	//МассивОсновной = Новый Массив ;
	//	МассивДополнительный = Новый Массив;
		//
		//МассивДляВозврата = Новый Массив;
		//ВременныйМассив = Новый Массив;

		//
		//Если МассивОсновной.Количество() < МассивДополнительный.Количество()Тогда
		//				
		//	Для Каждого ЭлементМассиваДополнительный Из МассивДополнительный Цикл
		//		  Для Каждого ЭлементМассиваОсновной Из МассивОсновной Цикл  
		//		
		//			Если ЭлементМассиваДополнительный.ИмяПараметра =ЭлементМассиваОсновной.ИмяПараметра Тогда
		//				   ЭлементМассиваДополнительный.Значение =ЭлементМассиваОсновной.Значение;
		//			   Иначе
		//				   ВременныйМассив.Добавить(ЭлементМассиваОсновной);
		//			КонецЕсли;	
		//		КонецЦикла;
		//	КонецЦикла;	
		//	
		//	Если ВременныйМассив.Количество() < МассивДополнительный.Количество()Тогда
		//		  Для Каждого ЭлементМассиваВременный Из ВременныйМассив Цикл
		//		  Для Каждого ЭлементМассиваДополнительный Из МассивДополнительный Цикл
		//				Если ЭлементМассиваВременный.ИмяПараметра <> ЭлементМассиваДополнительный.ИмяПараметра Тогда
		//					 МассивДополнительный.Добавить(ЭлементМассиваВременный);
		//				КонецЕсли;
		//			КонецЦикла;
		//		КонецЦикла;
		//		
		//		Возврат МассивДополнительный;   
		//		
		//	Иначе
		//		  Для Каждого ЭлементМассиваДополнительный Из МассивДополнительный Цикл

		//		   Для Каждого ЭлементМассиваВременный Из ВременныйМассив Цикл				 
		//				Если ЭлементМассиваВременный.ИмяПараметра <> ЭлементМассиваДополнительный.ИмяПараметра Тогда
		//					 ВременныйМассив.Добавить(ЭлементМассиваДополнительный);
		//				КонецЕсли;
		//			КонецЦикла;
		//			КонецЦикла;
		//		 Возврат ВременныйМассив; 
		//	КонецЕсли;	
		//		

		//Иначе
		//	
		//	Для Каждого ЭлементМассиваОсновной Из МассивОсновной Цикл
		//		НетВМассиве = истина;		
		//		Для Каждого ЭлементМассиваДополнительный Из МассивДополнительный Цикл
		//			
		//			Если ЭлементМассиваДополнительный.ИмяПараметра =ЭлементМассиваОсновной.ИмяПараметра Тогда
		//				ЭлементМассиваОсновной.Значение = ЭлементМассиваДополнительный.Значение;
		//			Иначе
		//				НетВМассиве = ложь;   
		//			КонецЕсли;
		//			   
		//		КонецЦикла;
		//		
		//		 Если НетВМассиве Тогда
		//			 ВременныйМассив.Добавить(ЭлементМассиваОсновной);

		//		 КонецЕсли;
		//	КонецЦикла;	
		//	
		//	
		//	Если ВременныйМассив.Количество() < МассивОсновной.Количество()Тогда
		//		  Для Каждого ЭлементМассиваВременный Из ВременныйМассив Цикл
		//		  Для Каждого ЭлементМассиваОсновной Из МассивОсновной Цикл
		//				Если ЭлементМассиваВременный.ИмяПараметра <> ЭлементМассиваОсновной.ИмяПараметра Тогда
		//					 МассивОсновной.Добавить(ЭлементМассиваВременный);
		//				КонецЕсли;
		//			КонецЦикла;
		//		КонецЦикла;
		//		
		//		Возврат МассивОсновной;   
		//		
		//	Иначе
		//		  Для Каждого ЭлементМассиваОсновной Из МассивОсновной Цикл

		//		   Для Каждого ЭлементМассиваВременный Из ВременныйМассив Цикл				 
		//				Если ЭлементМассиваВременный.ИмяПараметра <> ЭлементМассиваОсновной.ИмяПараметра Тогда
		//					 ВременныйМассив.Добавить(ЭлементМассиваОсновной);
		//				КонецЕсли;
		//			КонецЦикла;
		//			КонецЦикла;
		//		 Возврат ВременныйМассив; 
		//	КонецЕсли;	

		//	
		//КонецЕсли;	
		//
		
		

КонецФункции // ВыполнитьСлияниеДвухМассивов()
